<a href="https://colab.research.google.com/github/engnogueira/PythonParaCienciaDeDados/blob/master/06_contando_e_removendo_valores_em_branco.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Capítulo 1 - Manipulação de dados: Básico**

**Seção 6 - Contando e removendo valores em branco**

In [0]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

In [2]:
em_branco = np.nan
np.random.seed(25)
df = DataFrame(np.random.randn(36).reshape(6,6))
df.loc[3:5, 0] = em_branco
df.loc[1:4, 5] = em_branco
df

          0         1         2         3         4         5
0  0.228273  1.026890 -0.839585 -0.591182 -0.956888 -0.222326
1 -0.619915  1.837905 -2.053231  0.868583 -0.920734       NaN
2  2.152957 -1.334661  0.076380 -1.246089  1.202272       NaN
3       NaN -0.419678  2.294842 -2.594487  2.822756       NaN
4       NaN -1.976254  0.533340 -0.290870 -0.513520       NaN
5       NaN -1.839905  1.607671  0.388292  0.399732  0.405477

# **Contando valores em branco**

**nome_do_objeto.isnull().sum()**

In [3]:
df.isnull().sum()

0    3
1    0
2    0
3    0
4    0
5    4
dtype: int64

**Removendo valores em branco**

**nome_do_objeto.dropna()**

In [4]:
df.dropna()

          0        1         2         3         4         5
0  0.228273  1.02689 -0.839585 -0.591182 -0.956888 -0.222326

In [5]:
df.dropna(axis =1)

          1         2         3         4
0  1.026890 -0.839585 -0.591182 -0.956888
1  1.837905 -2.053231  0.868583 -0.920734
2 -1.334661  0.076380 -1.246089  1.202272
3 -0.419678  2.294842 -2.594487  2.822756
4 -1.976254  0.533340 -0.290870 -0.513520
5 -1.839905  1.607671  0.388292  0.399732